<a href="https://colab.research.google.com/github/oktaviacitra/data-mining/blob/main/Assignment3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Import Libraries

In [ ]:
import pandas as pd
import numpy as np

# Upload A File

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

# Read Data

In [ ]:
path = "/content/drive/MyDrive/Data Mining/titanic.csv"
dataframe = pd.read_csv(path)
dataframe

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

# Count The Number of Rows and Columns

In [ ]:
rows, cols = dataframe.shape
print("The Number of Rows is ", rows)
print("The Number of Columns is ", cols)

The Number of Rows is  891
The Number of Columns is  12

# Take Some of The Necessary Features

In [ ]:
data = dataframe.loc[:, ['Age', 'Fare']]
data

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

# Create A Variable to Hold The Label

In [ ]:
label = dataframe.loc[:, ['Survived']]
label

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 1 columns]

# Fill Missing Values with Mean in Each Class Label

In [ ]:
data = data.fillna(dataframe.groupby('Survived').transform('mean'))
data

           Age     Fare
0    22.000000   7.2500
1    38.000000  71.2833
2    26.000000   7.9250
3    35.000000  53.1000
4    35.000000   8.0500
..         ...      ...
886  27.000000  13.0000
887  19.000000  30.0000
888  30.626179  23.4500
889  26.000000  30.0000
890  32.000000   7.7500

[891 rows x 2 columns]

# Data Normalization

## Min-Max

In [ ]:
new_min, new_max = 0, 1
data_min_max = (data - data.min()) * (new_max - new_min) / (data.max() - data.min()) + new_min
data_min_max

          Age      Fare
0    0.271174  0.014151
1    0.472229  0.139136
2    0.321438  0.015469
3    0.434531  0.103644
4    0.434531  0.015713
..        ...       ...
886  0.334004  0.025374
887  0.233476  0.058556
888  0.379570  0.045771
889  0.321438  0.058556
890  0.396833  0.015127

[891 rows x 2 columns]

## Z-Score

In [ ]:
data_z_score = (data - data.mean()) / data.std()
data_z_score

          Age      Fare
0   -0.595670 -0.502163
1    0.634089  0.786404
2   -0.288230 -0.488580
3    0.403509  0.420494
4    0.403509 -0.486064
..        ...       ...
886 -0.211370 -0.386454
887 -0.826250 -0.044356
888  0.067338 -0.176164
889 -0.288230 -0.044356
890  0.172929 -0.492101

[891 rows x 2 columns]

## Sigmoidal

In [ ]:
data_sigmoidal = np.divide(1-np.exp(-data_z_score), 1+np.exp(-data_z_score))
data_sigmoidal

          Age      Fare
0   -0.289330 -0.245935
1    0.306832  0.374117
2   -0.143126 -0.239544
3    0.199061  0.207203
4    0.199061 -0.238358
..        ...       ...
886 -0.105293 -0.190857
887 -0.391123 -0.022174
888  0.033656 -0.087855
889 -0.143126 -0.022174
890  0.086250 -0.241203

[891 rows x 2 columns]